///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Структура StringView, содержащая указатель на строку и её длину.
// 
// Версия: 1.0.0.0
// Дата последнего изменения: 21:27 05.03.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#pragma once

#include "../General.h"

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

namespace UtilLib
{
	struct StringView
	{
		cptr    String;
		csize_t Length;
	};
}

/**
 * @brief   Создать объект StringView.
 * 
 * @warning Аргумент str должен быть строковым литералом, иначе размер строки будет 
 *          определён не верно. Для определения размера строки используется sizeof(str).
 *          Если sizeof(str) является не корректной операцией, нужно использовать
 *          strlen() или каким-либо другим способом определять длину строки и вручную
 *          инициализировать StringView.
 * 
 * @note    sizeof(str) - возвращает размер массива. Длина строки не учитывает 
 *          терминирующий '\0'.
*/
#define GET_STRING_VIEW(str) \
	StringView{str, sizeof(str) - 1}

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///