///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль обработки ошибок программы.
// 
// Версия: 1.0.0.1
// Дата последнего изменения: 21:08 04.03.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#pragma once

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

namespace UtilLib
{
	enum class ProgramStatus
	{
		/// Функция успешно завершила свою работу
		Ok = 0,

		/// Предупреждение. Возникла не критическая особая ситуация во время выполнения программы.
		Warning = 1,

		/// Критическая ошибка. Необходимо завершить выполнения программы.
		Fault = 2,

		/// Ещё не реализовано.
		/// Возвращается, если функция ещё не была реализована.
		NotImplemented = 3
	};
}

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///