///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Модуль зависимых определений макросов от операционной системы.
// 
// Версия: 1.0.0.2
// Дата последнего изменения: 21:10 04.03.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#if defined(WINDOWS)

#elif defined(LINUX)

#else

	#error Не определена выходная система.

#endif

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#if defined(MSVC)

	#define FUNCTION_SIGNATURE __FUNCSIG__

	#if defined(_DEBUG)
	
		#define DEBUG

	#endif // !_DEBUG

#elif defined(GCC)

	#define FUNCTION_SIGNATURE __PRETTY_FUNCTION__

#else

	#error Не известный компилятор.

#endif

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///