///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Файл подавления предупреждений компилятора и описания, почему они подавлены.
// 
// Версия: 1.0.0.1
// Дата последнего изменения: 21:08 04.03.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#pragma once

#if defined(MSVC)

	///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

	// 4464 - убирается в настройках проекта. Предупреждение, что в #include используется
	// относительный путь с переходом в родительскую директорию "..".
	// Относительные пути используются, чтобы подключать заголовочные файлы между модулями
	// стандартной библиотеки.

	///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#elif defined(GCC)

	///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///



	///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#else

	#error Не выбран тип компилятора

#endif

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///