///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
// Структура CodeLocation, содержащая отладочную информацию: имя функции, имя файла,
// номер строки кода.
// 
// Версия: 1.0.0.0
// Дата последнего изменения: 21:27 05.03.2023
// 
// Автор: Маслов А.С. (https://github.com/ArtemMaslov).
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

#pragma once

#include "../General.h"
#include "../TargetOS.h"

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///

namespace UtilLib
{
	struct CodeLocation
	{
		cptr    FunctName;
		cptr    FileName;
		csize_t Line;
	};
}

#define CODE_LOCATION \
	CodeLocation{FUNCTION_SIGNATURE, __FILE__, (size_t)__LINE__}

///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///
///***///***///---\\\***\\\***\\\___///***___***\\\___///***///***///---\\\***\\\***///